GetAggregatedObservations/testScripts/gatling/user-files/bodies/GetObservations.xml

<soapenv:Envelope 
   xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
   xmlns:urn="urn:riv:itintegration:registry:1" 
   xmlns:urn1="urn:riv:clinicalprocess:healthcond:basic:GetObservationsResponder:1" 
   xmlns:urn2="urn:riv:clinicalprocess:healthcond:basic:1">
   <soapenv:Header>
      <urn:LogicalAddress>5565594230</urn:LogicalAddress>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:GetObservations>
         <urn1:patientId>
            <urn2:root>1.2.752.129.2.1.3.1</urn2:root>
            <urn2:extension>${patientid}</urn2:extension>
         </urn1:patientId>
         <urn1:sourceSystemId/>
      </urn1:GetObservations>
   </soapenv:Body>
</soapenv:Envelope>